# There are two types of variable in machine learning 
# 1--->Nominal data

they don't have any sort of order present in it.
Example-
male -female
green-red-yellow

# 2---> Ornidanal Data

In [ ]:
They have some sort of order 
Example-Btech ,Mtech, Phd

In [9]:
import pandas as pd
df = pd.read_csv("hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
df['experience']=df['experience'].fillna("zero")

In [11]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [19]:
pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5580 sha256=ea20ef334b48c1520180f6e713ad33497b77e2931f63c4344ca5271f3cd53cc1
  Stored in directory: c:\users\arai5\appdata\local\pip\cache\wheels\21\1d\b2\768b65901d249c6eb2a8d9c30392506555a4e94055ba4e0aa0
Successfully built word2number
Installing collected packages: word2number
Note: you may need to restart the kernel to use updated packages.Successfully installed word2number-1.1

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ReadTimeoutError("HTTPSConnectionPool(host='pypi.org', port=443): Read timed out. (read timeout=15)")': /simple/word2number/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ReadTimeoutError("HTTPSConnectionPool(host='pypi.org', port=443): Read timed out. (read timeout=15)")': /simple/word2number/

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [20]:
from word2number import w2n
df.experience=df.experience.apply(w2n.word_to_num)

In [21]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [25]:
import math
df.rename(columns={'test_score(out of 10)': 'test_score'},inplace=True)

In [26]:
df.rename(columns={'interview_score(out of 10)': 'interview_score'},inplace=True)

In [27]:
df

   experience  test_score  interview_score  salary($)
0           0         8.0                9      50000
1           0         8.0                6      45000
2           5         6.0                7      60000
3           2        10.0               10      65000
4           7         9.0                6      70000
5           3         7.0               10      62000
6          10         NaN                7      72000
7          11         7.0                8      80000

In [29]:
mean_value = math.floor(df.test_score.mean())

In [30]:
print(mean_value)

7

In [33]:
df.test_score=df.test_score.fillna(mean_value)

In [34]:
df

   experience  test_score  interview_score  salary($)
0           0         8.0                9      50000
1           0         8.0                6      45000
2           5         6.0                7      60000
3           2        10.0               10      65000
4           7         9.0                6      70000
5           3         7.0               10      62000
6          10         7.0                7      72000
7          11         7.0                8      80000

In [36]:
df.test_score=df.test_score.astype(int)

In [37]:
df

   experience  test_score  interview_score  salary($)
0           0           8                9      50000
1           0           8                6      45000
2           5           6                7      60000
3           2          10               10      65000
4           7           9                6      70000
5           3           7               10      62000
6          10           7                7      72000
7          11           7                8      80000

In [38]:
from sklearn import linear_model
reg = linear_model.LinearRegression()

In [41]:
reg.fit(df[['experience','test_score','interview_score']],df['salary($)'])

LinearRegression()

In [43]:
reg.predict([[12,10,10]])[0]

93747.79628650834

In [44]:
import pickle 
with open('model.pickle','wb') as f:
    pickle.dump(reg,f)

In [45]:
with open('model.pickle','rb') as f:
    model =pickle.load(f)

In [47]:
model.predict([[10,6,5]])[0]

68280.60902627406